invex/app/views/scenes/_form.html.erb

SELECT "histories".* FROM "histories"
---
    <%#= form.text_field :history_id %>
    <%= form.select :history_id, History.all.collect{|p| [ p.titulo, p.id ] }, { include_blank: "Selecione" } %>