invex/app/controllers/users/registrations_controller.rb

UPDATE "users" SET "updated_at" = $1, "history_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2019-02-25 20:26:19.635158"], ["history_id", 1], ["id", 9]]
---
  def create
    super

    current_user.update_attributes(:history_id => 1)