invex/app/controllers/histories_controller.rb

SELECT "histories".* FROM "histories"
---
  def index
    @histories = History.all

SELECT  "histories".* FROM "histories" WHERE "histories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_history
      @history = History.find(params[:id])