invex/app/controllers/scenes_controller.rb

SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # raise("houahauohauo")
    @scene = Scene.all.where("history_id = #{params[:id]}")

INSERT INTO "scenes" ("imagem", "history_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["imagem", "IMG_20181205_073031473_HDR.jpg"], ["history_id", 1], ["created_at", "2019-02-26 19:47:10.816764"], ["updated_at", "2019-02-26 19:47:10.816764"]]
---
  def create
    @scene = Scene.new(scene_params)

    respond_to do |format|
      if @scene.save

SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def cont
    @scene = Scene.find(2)

SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def scene3
    @scene = Scene.find(3)

SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def scene4
    @scene = Scene.find(4)

SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_scene
      @scene = Scene.find(params[:id])

SELECT  "histories".* FROM "histories" ORDER BY "histories"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def set_history
    @history = History.all